
#Переменные 
x = 1
y = 10
#Массив
arr = [12,43,65,76]
#Строковая переменная

#Вывести все переменные на экран!!!!

#Основные операторы: 

# == это сравнение какой либо переменой со значением или другой переменной
# >< знаки больше/меньше для сравнения
# != не равно

# Операторы if и else

if(x == 0):
	print('X = ',x)
if(y == 0):
	print('Y = ',y)
else: print('X и Y не равны нулю')

if(x !=0):
	print('X не равно нулю')

if(x > 0):
	print('X больше нуля')

#Выполняем программу и анализируем результат

h = 1
while h < 100:
	h +=1
	print('h = ', h)

#Циклы - нужны для выполнения определенного кол-ва действий
G = 1
#Этот цикл бесконечный и будет увеличивать G на 1
# ctr + c - чтобы остановить
# while True:
# 	G +=1
# 	print(G)

